system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleDyMFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         10.0;

deltaT          1e-3;

writeControl    adjustableRunTime;

writeInterval   0.05;

purgeWrite      0;

writeFormat     binary;

writePrecision  10;

writeCompression compressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           2;

libs
(
    "libOpenFOAM.so"
    "libforces.so"
);

functions
{
    forces
    {
        type                forces;
        functionObjectLibs  ("libforces.so");
        outputControl       timeStep;
        outputInterval      1; // 10;
        patches             (blades shaft);
        pName               p;
        UName               U;
        rhoName             rhoInf;
        log                 true;
        rhoInf              1000.0;
        CofR                (0 0 0); // (0.25 0.007 0.125);
    }
}

// ************************************************************************* //
