constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

9
(
    inlet
    {
        type            patch;
        nFaces          110;
        startFace       82795;
    }
    outlet
    {
        type            patch;
        nFaces          110;
        startFace       82905;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          220;
        startFace       83015;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          41569;
        startFace       83235;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          41569;
        startFace       124804;
    }
    blades
    {
        type            wall;
        inGroups        1(wall);
        nFaces          760;
        startFace       166373;
    }
    shaft
    {
        type            wall;
        inGroups        1(wall);
        nFaces          260;
        startFace       167133;
    }
    AMI1
    {
        type            cyclicAMI;
        inGroups        
2
(
cyclicAMI
baffleFaces
)
;
        nFaces          312;
        startFace       167393;
        matchTolerance  1e-07;
        transform       noOrdering;
        neighbourPatch  AMI2;
    }
    AMI2
    {
        type            cyclicAMI;
        inGroups        
2
(
cyclicAMI
baffleFaces
)
;
        nFaces          312;
        startFace       167705;
        matchTolerance  1e-07;
        transform       noOrdering;
        neighbourPatch  AMI1;
    }
)

// ************************************************************************* //
