constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}


dynamicFvMesh   solidBodyMotionFvMesh;

motionSolverLibs ( "libfvMotionSolvers.so" );

solidBodyMotionFvMeshCoeffs
{
    cellZone        AMIsurface_z;

    solidBodyMotionFunction  rotatingMotion;
    rotatingMotionCoeffs
    {
	origin		(0 0 0);
	axis		(0 0 1);
        omega		table
	(
            (0.0 3.60626845303)
            (0.0200400801603 3.53530790259)
            (0.0400801603206 3.47810232865)
            (0.060120240481 3.43762447325)
            (0.0801603206413 3.41597780663)
            (0.100200400802 3.41428721839)
            (0.120240480962 3.43264056156)
            (0.140280561122 3.47008408723)
            (0.160320641283 3.52467200696)
            (0.180360721443 3.59356760763)
            (0.200400801603 3.67319066383)
            (0.220440881764 3.75940348774)
            (0.240480961924 3.84772594802)
            (0.260521042084 3.93356828403)
            (0.280561122244 4.01246961717)
            (0.300601202405 4.08032976465)
            (0.320641282565 4.13362230938)
            (0.340681362725 4.16957785362)
            (0.360721442886 4.18632793331)
            (0.380761523046 4.18300211465)
            (0.400801603206 4.15977322696)
            (0.420841683367 4.11784838148)
            (0.440881763527 4.05940624266)
            (0.460921843687 3.98748381181)
            (0.480961923848 3.90581860643)
            (0.501002004008 3.81865443656)
            (0.521042084168 3.73052087115)
            (0.541082164329 3.64599785474)
            (0.561122244489 3.56947770622)
            (0.581162324649 3.50493686786)
            (0.60120240481 3.4557292657)
            (0.62124248497 3.42441201957)
            (0.64128256513 3.41261255992)
            (0.661322645291 3.42094405691)
            (0.681362725451 3.44897355637)
            (0.701402805611 3.49524447871)
            (0.721442885772 3.55735231147)
            (0.741482965932 3.63206956205)
            (0.761523046092 3.7155134775)
            (0.781563126253 3.80334781542)
            (0.801603206413 3.89100818093)
            (0.821643286573 3.97393921979)
            (0.841683366733 4.04783134172)
            (0.861723446894 4.10884467236)
            (0.881763527054 4.15380859595)
            (0.901803607214 4.18038651948)
            (0.921843687375 4.18719729587)
            (0.941883767535 4.17388699665)
            (0.961923847695 4.14114730417)
            (0.981963927856 4.09067956769)
            (1.00200400802 4.02510639111)
            (1.02204408818 3.9478353469)
            (1.04208416834 3.86288189832)
            (1.0621242485 3.77466073212)
            (1.08216432866 3.68775634506)
            (1.10220440882 3.60668480625)
            (1.12224448898 3.53565907528)
            (1.14228456914 3.47837007178)
            (1.1623246493 3.43779487329)
            (1.18236472946 3.41604200858)
            (1.20240480962 3.41424188594)
            (1.22244488978 3.43248805046)
            (1.24248496994 3.46983232285)
            (1.2625250501 3.52433407249)
            (1.28256513026 3.59316106414)
            (1.30260521042 3.67273663774)
            (1.32264529058 3.75892557296)
            (1.34268537074 3.84724897984)
            (1.3627254509 3.93311704855)
            (1.38276553106 4.01206756328)
            (1.40280561122 4.07999778546)
            (1.42284569138 4.1333776565)
            (1.44288577154 4.16943324067)
            (1.4629258517 4.18629087525)
            (1.48296593186 4.18307453722)
            (1.50300601202 4.15995136667)
            (1.52304609218 4.11812298112)
            (1.54308617234 4.0597630324)
            (1.56312625251 3.98790425073)
            (1.58316633267 3.90628084602)
            (1.60320641283 3.8191344561)
            (1.62324649299 3.73099372598)
            (1.64328657315 3.6464389725)
            (1.66332665331 3.56986416381)
            (1.68336673347 3.50524858264)
            (1.70340681363 3.45595003912)
            (1.72344689379 3.42453037892)
            (1.74348697395 3.41262235456)
            (1.76352705411 3.42084477784)
            (1.78356713427 3.44877036272)
            (1.80360721443 3.49494792964)
            (1.82364729459 3.55697781742)
            (1.84368737475 3.63163658398)
            (1.86372745491 3.71504451551)
            (1.88376753507 3.80286723958)
            (1.90380761523 3.89054096481)
            (1.92384769539 3.97350964272)
            (1.94388777555 4.04746172709)
            (1.96392785571 4.10855422753)
...
            );
        }
    }