0.org/include/AMI
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

AMI1
{
    type  cyclicAMI;
    value   $internalField;
}

AMI2
{
    type  cyclicAMI;
    value   $internalField;
}

// ************************************************************************* //
