0.org/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-7;

boundaryField
{
    "blades.*"
    {
        type            nutLowReWallFunction;
        value           uniform 0;
    }

    "shaft.*"
    {
        type            nutLowReWallFunction;
        value           uniform 0;
    }

    "(inlet|outlet)"
    {
        type            calculated;
        value           uniform 0;
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }

    walls
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    #include "include/AMI"
}


// ************************************************************************* //
