system/createInletOutletSets.topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    outletFaces;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            name outlet;
        }
    }

    {
        name    inletFaces;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            name inlet;
        }
    }
);

// ************************************************************************* //
